Update to mermaid
